{
  "dishes": {
    "japan": [
      {
        "name": "Ramen",
        "type": "main",
        "description": "Traditional noodle soup with rich broth, often with pork, eggs, and vegetables",
        "difficulty": "Medium",
        "cultural_story": "Ramen originated in Japan in the early 20th century, influenced by Chinese noodle soups. It became popular after World War II when food was scarce, and street vendors would serve affordable, filling noodle soups. Today, ramen is considered Japan's national comfort food, with regional variations like tonkotsu from Fukuoka, miso from Sapporo, and shoyu from Tokyo. Each region has developed its own unique style, making ramen a culinary journey through Japan's diverse food culture.",
        "cooking_tips": "The key to authentic ramen is the broth - simmer pork bones for 8-12 hours to extract maximum flavor and collagen. For the perfect soft-boiled egg, cook for exactly 6 minutes and marinate in soy sauce mixture. Cook noodles al dente and rinse under cold water to stop cooking. Layer flavors: start with tare (seasoning), add hot broth, then noodles, and finally toppings. The broth should be piping hot when served."
      },
      {
        "name": "Sushi",
        "type": "main",
        "description": "Vinegared rice with raw fish, vegetables, or other ingredients",
        "difficulty": "Hard",
        "cultural_story": "Sushi began as a preservation method in Southeast Asia over 2,000 years ago, where fish was fermented with rice and salt. The modern form of sushi emerged in Edo (now Tokyo) during the 19th century as a quick street food. The term 'sushi' actually refers to the vinegared rice, not the fish. Traditional sushi emphasizes the rice as much as the topping, with each grain carefully seasoned. In Japanese culture, sushi is often eaten on special occasions and represents the harmony between human skill and nature's bounty.",
        "cooking_tips": "Use short-grain Japanese rice and rinse thoroughly until water runs clear. The rice-to-vinegar ratio is crucial: 5:1:1 (rice:vinegar:sugar:salt). Cook rice with slightly less water than usual for firmer texture. When forming nigiri, wet your hands with water and vinegar to prevent sticking. The fish should be at room temperature for best flavor. For maki rolls, use a bamboo mat and roll tightly but gently to avoid crushing the rice."
      },
      {
        "name": "Yakitori",
        "type": "main",
        "description": "Grilled chicken skewers with tare sauce",
        "difficulty": "Easy",
        "cultural_story": "Yakitori literally means 'grilled bird' and has been a popular street food in Japan since the Edo period (1603-1868). Originally made from leftover chicken parts that couldn't be sold whole, yakitori became a beloved izakaya (pub) food. The skewers are typically cooked over binchotan charcoal, which burns hotter and cleaner than regular charcoal. In Japanese culture, yakitori represents the art of making something delicious from humble ingredients, and the communal experience of sharing skewers over drinks with friends.",
        "cooking_tips": "Use chicken thigh meat for juicier results and cut into uniform 1-inch pieces. Soak bamboo skewers in water for 30 minutes to prevent burning. Grill over high heat, turning frequently to prevent charring. Apply tare sauce (soy sauce, mirin, sake, sugar) in the last 2-3 minutes of cooking. Don't overcrowd the skewers - leave space between pieces for even cooking. Serve immediately while hot and crispy."
      },
      {
        "name": "Miso Soup",
        "type": "appetizer",
        "description": "Traditional soup made from fermented soybean paste",
        "difficulty": "Easy",
        "cultural_story": "Miso soup is a cornerstone of Japanese cuisine, served daily in most households. Miso itself has been made in Japan for over 1,300 years, introduced from China during the Nara period. The fermentation process creates umami flavor and beneficial probiotics. Traditional miso soup is made with dashi (fish and seaweed stock) and varies by region - white miso in Kyoto, red miso in Nagoya, and barley miso in northern Japan. In Japanese culture, miso soup represents the balance of flavors and is considered essential for a complete meal.",
        "cooking_tips": "Never boil miso paste directly - it destroys beneficial enzymes and changes the flavor. Add miso at the end of cooking, stirring gently to dissolve. Use different types of miso for different dishes: white miso for light soups, red miso for hearty dishes. Make dashi from scratch using kombu and bonito flakes for authentic flavor. Add ingredients in order of cooking time: root vegetables first, then tofu and green onions last."
      }
    ],
    "italy": [
      {
        "name": "Risotto alla Milanese",
        "type": "main",
        "description": "Creamy saffron risotto with bone marrow and parmesan",
        "difficulty": "Medium",
        "cultural_story": "Risotto alla Milanese was created in 1574 when a Flemish glassmaker working on Milan's cathedral added saffron to rice as a joke, turning it golden yellow. The dish became a symbol of Milan's wealth and sophistication, as saffron was an expensive spice imported from Spain. The addition of bone marrow (ossobuco) came later, creating the classic pairing. This dish represents the fusion of northern Italian rice culture with exotic spices, showcasing Milan's position as a wealthy trading city during the Renaissance.",
        "cooking_tips": "Use Carnaroli or Arborio rice for the best creamy texture. Toast the rice in butter until translucent before adding liquid. Add hot stock gradually, one ladle at a time, stirring constantly. The key is 'mantecatura' - vigorously stir in cold butter and parmesan at the end to create creaminess. Saffron should be steeped in hot stock for 15 minutes before adding. The final texture should be 'all'onda' (wavy) - creamy but not mushy."
      },
      {
        "name": "Osso Buco",
        "type": "main",
        "description": "Braised veal shanks in white wine and broth with gremolata",
        "difficulty": "Hard",
        "cultural_story": "Osso Buco means 'bone with a hole' in Milanese dialect, referring to the marrow-filled bone in the center of the veal shank. This dish originated in Milan in the 19th century as a way to use inexpensive cuts of meat. The slow braising method tenderizes the tough meat while the marrow adds rich flavor. Traditionally served with risotto alla Milanese, this combination represents the hearty, comforting cuisine of northern Italy. The gremolata (lemon zest, garlic, parsley) adds brightness and is essential for cutting through the richness.",
        "cooking_tips": "Choose veal shanks cut 2-3 inches thick with plenty of marrow. Tie them with kitchen twine to keep the meat attached to the bone during cooking. Brown the meat thoroughly on all sides to develop flavor. Use a heavy-bottomed pot and braise at a gentle simmer for 2-3 hours. The meat is done when it falls off the bone. Don't skip the gremolata - it's essential for balancing the rich flavors."
      },
      {
        "name": "Carbonara",
        "type": "main",
        "description": "Pasta with eggs, pecorino cheese, guanciale, and black pepper",
        "difficulty": "Medium",
        "cultural_story": "Carbonara originated in Rome after World War II, when American soldiers brought eggs and bacon to Italy. Italian cooks adapted these ingredients with local pecorino cheese and guanciale (cured pork cheek) to create a uniquely Roman dish. The name 'carbonara' refers to coal miners (carbonai) who supposedly ate this hearty dish. The key is the creamy sauce made from eggs and cheese, not cream, which was added later by non-Italian restaurants. Authentic carbonara uses only eggs, pecorino Romano, guanciale, and black pepper.",
        "cooking_tips": "Use guanciale, not pancetta or bacon, for authentic flavor. Cook the guanciale until crispy and reserve the fat. Cook pasta al dente and reserve 1 cup of starchy pasta water. Mix eggs and grated pecorino Romano in a bowl. Add hot pasta to the guanciale, remove from heat, then quickly stir in the egg mixture to create a creamy sauce without scrambling. Add pasta water as needed for creaminess."
      },
      {
        "name": "Bruschetta",
        "type": "appetizer",
        "description": "Toasted bread topped with tomatoes, garlic, and olive oil",
        "difficulty": "Easy",
        "cultural_story": "Bruschetta comes from the Italian word 'bruscare' meaning 'to roast over coals.' This simple dish originated in central Italy as a way to use stale bread and showcase the region's excellent olive oil and tomatoes. Originally, peasants would toast bread over open fires and rub it with garlic and olive oil. The tomato topping was added later when tomatoes became popular in Italian cuisine. Bruschetta represents the Italian philosophy of 'cucina povera' (poor kitchen) - making something delicious from simple, humble ingredients.",
        "cooking_tips": "Use a rustic Italian bread like ciabatta or sourdough, sliced 1/2 inch thick. Grill or toast until golden brown and crispy. Rub with a cut garlic clove while still hot. Use ripe, flavorful tomatoes and let them drain to avoid soggy bread. Drizzle with high-quality extra virgin olive oil. The bread should be crispy enough to hold the toppings without getting soggy."
      }
    ],
    "mexico": [
      {
        "name": "Mole Poblano",
        "type": "main",
        "description": "Complex sauce with chocolate, chilies, and spices served over turkey",
        "difficulty": "Hard",
        "cultural_story": "Mole Poblano was created in the 17th century by nuns at the Santa Rosa convent in Puebla, Mexico. According to legend, they were told that the archbishop was coming for dinner and had to create something special with limited ingredients. They combined local chilies, chocolate, spices, and nuts to create this complex sauce. The word 'mole' comes from the Nahuatl word 'molli' meaning sauce or concoction. This dish represents the fusion of indigenous Mexican ingredients with Spanish colonial influences, creating one of Mexico's most celebrated culinary traditions.",
        "cooking_tips": "Toast all spices and chilies separately to develop individual flavors before grinding. Use Mexican chocolate (like Ibarra or Abuelita) for authentic flavor. The sauce should be simmered for at least 2 hours to meld flavors. Strain through a fine mesh sieve for smooth texture. The balance of sweet, spicy, and bitter flavors is crucial. Serve with turkey or chicken and garnish with sesame seeds and fresh herbs."
      },
      {
        "name": "Cochinita Pibil",
        "type": "main",
        "description": "Achiote-marinated pork wrapped in banana leaves and slow-roasted",
        "difficulty": "Medium",
        "cultural_story": "Cochinita Pibil is a traditional Yucatecan dish with Mayan origins. The word 'pibil' means 'buried' in Mayan, referring to the traditional cooking method where the pork was wrapped in banana leaves and cooked in an underground pit. Achiote (annatto) gives the dish its distinctive red color and earthy flavor. This dish represents the ancient Mayan cooking techniques that have been preserved and adapted over centuries. The banana leaves not only protect the meat during cooking but also impart a subtle, earthy flavor.",
        "cooking_tips": "Use pork shoulder or butt for tenderness and flavor. Marinate in achiote paste, citrus juice, and spices for at least 4 hours or overnight. Wrap tightly in banana leaves to keep the meat moist. Cook low and slow (300°F for 3-4 hours) until the meat falls apart. The traditional accompaniment is pickled red onions and habanero salsa. The meat should be tender enough to shred with a fork."
      },
      {
        "name": "Chiles Rellenos",
        "type": "main",
        "description": "Poblano peppers stuffed with cheese, battered and fried",
        "difficulty": "Medium",
        "cultural_story": "Chiles Rellenos originated in Puebla, Mexico, during the colonial period. The dish combines Spanish frying techniques with indigenous Mexican ingredients. Poblano peppers are native to Mexico and were cultivated by the Aztecs. The stuffing traditionally included cheese, but variations include meat, seafood, or vegetables. This dish represents the creativity of Mexican cooks who adapted European cooking methods to local ingredients. The name means 'stuffed peppers' and is a staple of Mexican home cooking.",
        "cooking_tips": "Char the poblano peppers over an open flame until blackened, then steam in a paper bag to loosen the skin. Make a small slit to remove seeds while keeping the pepper intact. Stuff with cheese and secure with toothpicks. Separate egg whites and yolks - beat whites to stiff peaks, then fold in yolks and flour for the batter. Fry in hot oil until golden brown. Serve immediately with tomato sauce."
      },
      {
        "name": "Guacamole",
        "type": "appetizer",
        "description": "Fresh avocado dip with lime, onion, and cilantro",
        "difficulty": "Easy",
        "cultural_story": "Guacamole has ancient Aztec origins, with the word coming from the Nahuatl 'ahuacamolli' meaning 'avocado sauce.' The Aztecs made a simple version with mashed avocados, tomatoes, and salt. The modern version with lime, onion, and cilantro evolved over time. Avocados were considered a luxury food by the Aztecs and were highly valued for their rich, creamy texture. Guacamole represents the fresh, vibrant flavors of Mexican cuisine and is often made fresh at the table, allowing each person to customize the seasoning to their taste.",
        "cooking_tips": "Use ripe Hass avocados that yield to gentle pressure. Mash with a fork for chunky texture or use a food processor for smooth. Add lime juice immediately to prevent browning. Use white onion for milder flavor, red onion for more bite. Add salt gradually and taste as you go. The key is balance - not too much lime, not too much salt. Serve immediately for best flavor and texture."
      }
    ],
    "india": [
      {
        "name": "Biryani",
        "type": "main",
        "description": "Fragrant rice dish with meat, spices, and aromatic herbs",
        "difficulty": "Hard",
        "cultural_story": "Biryani originated in the royal kitchens of the Mughal Empire in the 16th century. The dish was created by Persian chefs who combined fragrant basmati rice with tender meat and aromatic spices. The word 'biryani' comes from the Persian 'birian' meaning 'fried before cooking.' Each region of India has developed its own version - Hyderabadi biryani uses goat meat and saffron, Lucknowi biryani is lighter with more spices, and Kolkata biryani includes potatoes. Biryani represents the fusion of Persian, Turkish, and Indian culinary traditions.",
        "cooking_tips": "Use aged basmati rice and soak for 30 minutes before cooking. Layer the dish: rice, meat, rice, then seal with dough to trap steam. Cook on low heat for 45 minutes to allow flavors to meld. The key is 'dum' cooking - slow cooking in a sealed pot. Use whole spices for authentic flavor and remove before serving. The rice should be fluffy and the meat tender. Garnish with fried onions, mint, and boiled eggs."
      },
      {
        "name": "Butter Chicken",
        "type": "main",
        "description": "Tender chicken in rich tomato and cream sauce",
        "difficulty": "Medium",
        "cultural_story": "Butter Chicken (Murgh Makhani) was invented in the 1950s at the Moti Mahal restaurant in Delhi. The chef, Kundan Lal Gujral, created this dish to use leftover tandoori chicken. He simmered the chicken in a rich sauce made with tomatoes, cream, and butter. The dish became so popular that it's now considered one of India's most famous exports. It represents the innovation of Indian chefs who adapted traditional cooking methods to create new dishes that appeal to both local and international palates.",
        "cooking_tips": "Marinate chicken in yogurt and spices for at least 4 hours. Cook chicken in a tandoor or grill until charred but not fully cooked. The sauce should be made with fresh tomatoes, not canned. Add cream and butter at the end to prevent curdling. The key is balancing the acidity of tomatoes with the richness of cream. Serve with naan bread and basmati rice."
      },
      {
        "name": "Dal Tadka",
        "type": "main",
        "description": "Lentils tempered with spices and aromatics",
        "difficulty": "Easy",
        "cultural_story": "Dal Tadka is a staple of Indian home cooking, with 'dal' meaning lentils and 'tadka' referring to the tempering of spices in hot oil. This technique releases the essential oils and flavors of spices. Different regions use different lentils - toor dal in Maharashtra, masoor dal in North India, and moong dal in Gujarat. The dish represents the Indian philosophy of making nutritious, flavorful food from simple ingredients. It's often the first solid food given to babies and remains a comfort food throughout life.",
        "cooking_tips": "Use fresh lentils and rinse thoroughly before cooking. Cook lentils until soft but not mushy. The tempering (tadka) is crucial - heat oil until smoking, add mustard seeds, cumin, garlic, and chilies. Pour the hot tempering over the dal to release aromas. Add asafoetida for authentic flavor. The consistency should be thick but pourable."
      },
      {
        "name": "Samosas",
        "type": "appetizer",
        "description": "Crispy pastry filled with spiced potatoes and peas",
        "difficulty": "Medium",
        "cultural_story": "Samosas originated in the Middle East and were brought to India by traders in the 13th-14th centuries. The word 'samosa' comes from the Persian 'sanbosag.' In India, the filling evolved to use local ingredients like potatoes, peas, and Indian spices. Samosas became popular street food and are now served at every celebration. The triangular shape is said to represent the three aspects of life: past, present, and future. They represent the adaptation of foreign dishes to Indian tastes and ingredients.",
        "cooking_tips": "Make the dough with a mix of all-purpose and whole wheat flour for texture. The filling should be dry to prevent soggy pastry. Seal the edges with a flour-water paste. Fry in medium-hot oil to ensure even cooking. The pastry should be golden brown and crispy. Serve with chutney and tamarind sauce."
      }
    ],
    "france": [
      {
        "name": "Coq au Vin",
        "type": "main",
        "description": "Braised chicken in red wine with mushrooms and pearl onions",
        "difficulty": "Medium",
        "cultural_story": "Coq au Vin originated in Burgundy, France, as a peasant dish made with tough rooster meat. The dish was created to tenderize older birds by braising them in wine. The name means 'rooster in wine' and was traditionally made with Burgundy red wine. The dish gained international fame when Julia Child featured it in her cookbook 'Mastering the Art of French Cooking.' It represents the French philosophy of transforming humble ingredients into elegant dishes through careful cooking techniques.",
        "cooking_tips": "Use chicken thighs and legs for best flavor and tenderness. Marinate the chicken in wine overnight for deeper flavor. Brown the chicken thoroughly before braising. Use a full-bodied red wine like Burgundy or Pinot Noir. The sauce should be reduced until thick and glossy. Serve with crusty bread to soak up the sauce."
      },
      {
        "name": "Bouillabaisse",
        "type": "main",
        "description": "Provençal fish stew with saffron and rouille",
        "difficulty": "Hard",
        "cultural_story": "Bouillabaisse originated in Marseille, France, as a fisherman's stew made with the catch of the day. The name comes from the Provençal 'bolhabaissa' meaning 'to boil and simmer.' Traditionally, fishermen would make this stew with the fish they couldn't sell at market. The dish includes at least four types of fish and shellfish, flavored with saffron, fennel, and orange peel. It represents the Mediterranean influence on French cuisine and the resourcefulness of coastal communities.",
        "cooking_tips": "Use at least four types of fish and shellfish for authentic flavor. Make the broth with fish heads and bones for depth. Add saffron early to infuse the broth. The rouille (garlic mayonnaise) should be spicy and served on the side. Cook fish in order of thickness - thickest first. Serve with crusty bread and rouille."
      },
      {
        "name": "Ratatouille",
        "type": "main",
        "description": "Provençal vegetable stew with eggplant, zucchini, and tomatoes",
        "difficulty": "Easy",
        "cultural_story": "Ratatouille originated in Nice, France, as a peasant dish made with summer vegetables. The name comes from the French 'ratouiller' meaning 'to stir up.' The dish was created to use the abundant summer vegetables of Provence. Each vegetable is cooked separately to maintain its individual flavor and texture, then combined. Ratatouille represents the French emphasis on seasonal, local ingredients and the art of vegetable cookery.",
        "cooking_tips": "Cook each vegetable separately to maintain individual flavors. Use fresh, ripe tomatoes for the best sauce. Layer the vegetables in the final dish for visual appeal. The dish should be served at room temperature to allow flavors to meld. Use fresh herbs like thyme and basil for authentic Provençal flavor."
      },
      {
        "name": "French Onion Soup",
        "type": "appetizer",
        "description": "Caramelized onion soup with melted cheese and bread",
        "difficulty": "Medium",
        "cultural_story": "French Onion Soup has been a staple of French cuisine since the 18th century. The dish was created as a way to use leftover bread and make a hearty, inexpensive meal. The long caramelization of onions creates deep, sweet flavors. The soup was traditionally served to late-night workers and became popular in Parisian bistros. It represents the French philosophy of making something delicious from simple, humble ingredients through careful cooking techniques.",
        "cooking_tips": "Caramelize onions slowly over low heat for at least 45 minutes. Use a mix of sweet and yellow onions for depth of flavor. The broth should be rich and flavorful. Use Gruyère cheese for authentic flavor. Broil the cheese until bubbly and golden. The soup should be served piping hot."
      }
    ],
    "thailand": [
      {
        "name": "Pad Thai",
        "type": "main",
        "description": "Stir-fried rice noodles with eggs, tofu, and tamarind sauce",
        "difficulty": "Medium",
        "cultural_story": "Pad Thai was created in the 1930s by Prime Minister Plaek Phibunsongkhram as part of a campaign to modernize Thailand and reduce rice consumption. The dish combines Chinese stir-frying techniques with Thai flavors like tamarind, fish sauce, and palm sugar. The name means 'Thai-style stir-fry' and was designed to be a national dish that could be made with readily available ingredients. Pad Thai represents the fusion of Chinese and Thai culinary traditions and Thailand's ability to adapt foreign techniques to local tastes.",
        "cooking_tips": "Soak rice noodles in warm water for 30 minutes before cooking. Use a wok or large skillet over high heat for authentic stir-frying. Add ingredients in order: garlic, protein, eggs, noodles, sauce. The key is the balance of sweet (palm sugar), sour (tamarind), and salty (fish sauce). Don't overcook the noodles - they should be al dente. Garnish with crushed peanuts, lime, and fresh herbs."
      },
      {
        "name": "Tom Yum Goong",
        "type": "main",
        "description": "Spicy and sour shrimp soup with lemongrass and galangal",
        "difficulty": "Medium",
        "cultural_story": "Tom Yum Goong is a traditional Thai soup that originated in central Thailand. The name means 'boiling shrimp soup' and is characterized by its hot and sour flavors. The soup uses indigenous Thai ingredients like lemongrass, galangal, kaffir lime leaves, and Thai chilies. It's considered a comfort food and is often served to people with colds due to its warming properties. The soup represents the Thai philosophy of balancing the four tastes: sweet, sour, salty, and spicy.",
        "cooking_tips": "Use fresh lemongrass, galangal, and kaffir lime leaves for authentic flavor. Make the broth with shrimp shells for depth. Add chilies according to taste - Thai chilies are very hot. The soup should be served immediately to maintain the fresh flavors. Don't overcook the shrimp - they should be just pink. Garnish with fresh cilantro and lime wedges."
      },
      {
        "name": "Green Curry",
        "type": "main",
        "description": "Coconut milk curry with green chilies and Thai basil",
        "difficulty": "Medium",
        "cultural_story": "Green Curry (Kaeng Khiao Wan) originated in central Thailand and is one of the most popular Thai curries. The green color comes from fresh green chilies, which are ground with herbs and spices to make the curry paste. The dish was traditionally made with chicken or fish and served with rice. Green curry represents the Thai love of fresh herbs and the importance of curry in Thai cuisine. The name means 'sweet green curry' and refers to the balance of spicy and sweet flavors.",
        "cooking_tips": "Make your own green curry paste for the best flavor. Use fresh coconut milk and don't let it boil too vigorously. Add vegetables in order of cooking time. The curry should be thick and creamy, not watery. Use Thai basil for authentic flavor. The heat should be balanced with coconut milk and palm sugar."
      },
      {
        "name": "Som Tam",
        "type": "appetizer",
        "description": "Green papaya salad with lime, fish sauce, and chilies",
        "difficulty": "Easy",
        "cultural_story": "Som Tam originated in northeastern Thailand (Isaan) and is now popular throughout the country. The name means 'sour pounded' and refers to the method of pounding the ingredients in a mortar and pestle. The dish combines the four Thai tastes: sour (lime), sweet (palm sugar), salty (fish sauce), and spicy (chilies). Som Tam represents the Thai emphasis on fresh, raw vegetables and the importance of texture in Thai cuisine. It's often served with sticky rice and grilled chicken.",
        "cooking_tips": "Use unripe green papaya for the best texture. Pound the ingredients gently to release flavors without making them mushy. Adjust the balance of sweet, sour, salty, and spicy to taste. The salad should be crunchy and fresh. Serve immediately to maintain texture. Use Thai chilies for authentic heat."
      }
    ],
    "morocco": [
      {
        "name": "Tagine",
        "type": "main",
        "description": "Slow-cooked stew with meat, vegetables, and preserved lemons",
        "difficulty": "Medium",
        "cultural_story": "Tagine refers to both the dish and the distinctive clay pot with a conical lid used to cook it. This cooking method originated with the Berber people of North Africa and has been used for centuries. The conical lid collects steam and returns it to the dish, creating tender, flavorful food. Tagines are traditionally cooked over charcoal or wood fires. The dish represents the Moroccan philosophy of slow cooking and the importance of communal dining. Each region of Morocco has its own variations, from lamb with prunes in the north to fish tagines on the coast.",
        "cooking_tips": "Use a traditional tagine pot if possible, or a heavy-bottomed pot with a tight lid. Layer ingredients with meat on the bottom, vegetables on top. Add liquid sparingly - the steam will create moisture. Cook on low heat for 2-3 hours until meat is tender. Use preserved lemons and olives for authentic flavor. The sauce should be thick and flavorful."
      },
      {
        "name": "Couscous",
        "type": "main",
        "description": "Steamed semolina grains with vegetables and meat",
        "difficulty": "Medium",
        "cultural_story": "Couscous is considered the national dish of Morocco and has been prepared for over 1,000 years. The word 'couscous' comes from the Berber word 'kuskus' meaning 'well-formed.' Traditionally, women would spend hours rolling semolina by hand to create the tiny grains. Couscous is served on Fridays (the Muslim holy day) and at celebrations. The dish represents the importance of grains in North African cuisine and the skill required to make perfect couscous. It's often served with seven vegetables, representing the seven days of the week.",
        "cooking_tips": "Use fine semolina couscous for traditional texture. Steam the couscous over the stew to absorb flavors. Fluff with a fork after steaming to separate grains. The couscous should be light and fluffy, not sticky. Serve with the stew spooned over the top. Use a couscoussière (special steamer) for authentic results."
      },
      {
        "name": "Pastilla",
        "type": "main",
        "description": "Sweet and savory pie with pigeon, almonds, and phyllo",
        "difficulty": "Hard",
        "cultural_story": "Pastilla (B'stilla) originated in Fez, Morocco, and combines sweet and savory flavors in a unique way. The dish was created in the royal kitchens and combines Moroccan spices with Andalusian pastry techniques. The layers of phyllo dough represent the layers of Moroccan society, while the combination of pigeon, almonds, and cinnamon represents the fusion of Arab, Berber, and Jewish culinary traditions. Pastilla is traditionally served at weddings and celebrations, symbolizing prosperity and abundance.",
        "cooking_tips": "Layer phyllo dough with butter between each sheet. The filling should be well-seasoned and not too wet. Use ground almonds and cinnamon for the sweet layer. Brush the top with butter and sprinkle with powdered sugar and cinnamon. The pie should be golden brown and crispy. Serve hot for the best texture."
      },
      {
        "name": "Harira",
        "type": "appetizer",
        "description": "Hearty soup with lentils, chickpeas, and tomatoes",
        "difficulty": "Easy",
        "cultural_story": "Harira is the traditional soup served to break the fast during Ramadan. The soup is rich and nourishing, providing energy after a day of fasting. The name comes from the Arabic word for 'silk,' referring to the smooth texture of the soup. Harira is made with lamb, lentils, chickpeas, and tomatoes, thickened with flour and egg. The soup represents the Moroccan emphasis on hospitality and the importance of breaking the fast with family and friends.",
        "cooking_tips": "Use lamb for authentic flavor. Add flour gradually to avoid lumps. The soup should be thick but not too heavy. Add lemon juice at the end for brightness. Serve with dates and chebakia (fried pastries) for traditional Ramadan meal."
      }
    ],
    "ethiopia": [
      {
        "name": "Doro Wat",
        "type": "main",
        "description": "Spicy chicken stew with berbere spice and boiled eggs",
        "difficulty": "Medium",
        "cultural_story": "Doro Wat is Ethiopia's national dish and is traditionally served at celebrations and holidays. The dish features chicken stewed in berbere spice, a complex blend of chilies and spices that is central to Ethiopian cuisine. The boiled eggs in the stew represent fertility and are often served at weddings. Doro Wat is typically eaten with injera (sourdough flatbread) and represents the communal nature of Ethiopian dining, where food is shared from a common plate. The dish showcases Ethiopia's unique spice culture and the importance of chicken in Ethiopian celebrations.",
        "cooking_tips": "Use bone-in chicken pieces for authentic flavor. Make berbere spice from scratch or use high-quality store-bought. The stew should be thick and spicy. Add boiled eggs towards the end of cooking. Serve with injera bread for authentic experience. The sauce should be rich and flavorful, not watery."
      },
      {
        "name": "Kitfo",
        "type": "main",
        "description": "Minced beef tartare with spices and clarified butter",
        "difficulty": "Easy",
        "cultural_story": "Kitfo is a traditional Ethiopian dish made with raw minced beef, similar to steak tartare. The dish originated with the Gurage people of southern Ethiopia and is often served at celebrations. The beef is seasoned with mitmita (spicy chili powder) and niter kibbeh (clarified butter with spices). Kitfo represents the Ethiopian love of raw meat dishes and the importance of spices in Ethiopian cuisine. It's traditionally served with ayib (fresh cheese) and gomen (collard greens).",
        "cooking_tips": "Use the freshest, highest-quality beef possible. Grind the meat finely and keep it cold. Season with mitmita and niter kibbeh to taste. The dish should be spicy but not overwhelming. Serve immediately to maintain freshness. Accompany with ayib and gomen for traditional experience."
      },
      {
        "name": "Shiro",
        "type": "main",
        "description": "Ground chickpea stew with spices and aromatics",
        "difficulty": "Easy",
        "cultural_story": "Shiro is a popular Ethiopian vegetarian dish made from ground chickpeas or lentils. The dish is a staple of Ethiopian cuisine and is often served during fasting periods when meat is not consumed. Shiro can be made mild or spicy depending on the amount of berbere added. The dish represents the Ethiopian emphasis on vegetarian options and the skillful use of legumes in Ethiopian cooking. It's typically served with injera and is a comforting, nutritious meal.",
        "cooking_tips": "Use ground chickpea flour for authentic texture. Add berbere gradually to control spiciness. The stew should be thick and smooth. Cook slowly to develop flavors. Serve hot with injera bread. Can be made mild or spicy according to preference."
      },
      {
        "name": "Sambusas",
        "type": "appetizer",
        "description": "Crispy pastry filled with spiced lentils or meat",
        "difficulty": "Medium",
        "cultural_story": "Sambusas are Ethiopia's version of samosas, brought to the country through trade with the Middle East and India. The pastry is filled with spiced lentils, meat, or vegetables and deep-fried until crispy. Sambusas are popular street food and are often served at celebrations. The dish represents the cultural exchange between Ethiopia and other countries along the spice trade routes. They are typically served with spicy dipping sauces and are a favorite snack throughout Ethiopia.",
        "cooking_tips": "Make the dough with a mix of all-purpose and whole wheat flour. The filling should be well-seasoned and not too wet. Seal the edges with a flour-water paste. Fry in medium-hot oil until golden brown. Serve with spicy dipping sauce. The pastry should be crispy and flaky."
      }
    ],
    "argentina": [
      {
        "name": "Asado",
        "type": "main",
        "description": "Traditional barbecue with various cuts of beef",
        "difficulty": "Medium",
        "cultural_story": "Asado is Argentina's national dish and represents the country's deep connection to cattle ranching and gaucho culture. The tradition of asado dates back to the gauchos (cowboys) who would slow-cook meat over open fires while working on the pampas. Asado is more than just food - it's a social event that can last for hours, bringing families and friends together. The meat is cooked slowly over wood or charcoal, often using a parrilla (grill) or cross (cross-shaped spit). Asado represents Argentina's love of beef and the importance of communal dining in Argentine culture.",
        "cooking_tips": "Use hardwood charcoal or wood for authentic flavor. Cook meat slowly over indirect heat. Season simply with salt - let the meat flavor shine. Different cuts require different cooking times. Rest meat before serving. Serve with chimichurri sauce and simple sides like grilled vegetables."
      },
      {
        "name": "Milanesa",
        "type": "main",
        "description": "Breaded and fried beef cutlet with lemon",
        "difficulty": "Easy",
        "cultural_story": "Milanesa was brought to Argentina by Italian immigrants in the late 19th century. The dish is Argentina's version of the Italian cotoletta alla Milanese. It became popular because it was an affordable way to enjoy beef, using cheaper cuts that are tenderized through pounding and breading. Milanesa is now a staple of Argentine home cooking and is often served with mashed potatoes or as a sandwich (milanesa al pan). The dish represents the fusion of Italian and Argentine culinary traditions.",
        "cooking_tips": "Pound the meat thin and even for consistent cooking. Use fresh breadcrumbs for better texture. Season the meat before breading. Fry in hot oil until golden brown. Serve with lemon wedges and simple sides. Can be made with chicken or veal as well."
      },
      {
        "name": "Locro",
        "type": "main",
        "description": "Hearty stew with corn, beans, and meat",
        "difficulty": "Medium",
        "cultural_story": "Locro is a traditional Argentine stew that originated with the indigenous peoples of the Andes. The dish combines Spanish and indigenous ingredients, including white corn, beans, and various meats. Locro is traditionally served on May 25th (Argentina's Independence Day) and other national holidays. The stew represents the fusion of indigenous and European culinary traditions and the importance of hearty, communal meals in Argentine culture. It's often served with chimichurri sauce and is considered a comfort food.",
        "cooking_tips": "Use white corn (hominy) for authentic texture. Cook slowly to develop flavors. Add meat in order of cooking time. The stew should be thick and hearty. Serve hot with chimichurri sauce. Can be made vegetarian with just beans and vegetables."
      },
      {
        "name": "Empanadas",
        "type": "appetizer",
        "description": "Baked or fried pastries filled with meat or vegetables",
        "difficulty": "Medium",
        "cultural_story": "Empanadas were brought to Argentina by Spanish settlers and have become one of the country's most beloved foods. Each region of Argentina has its own variation - beef empanadas in Buenos Aires, spicy empanadas in the northwest, and seafood empanadas on the coast. The pastry is often decorated with different patterns to indicate the filling. Empanadas are served at celebrations, family gatherings, and as street food. They represent the Spanish influence on Argentine cuisine and the country's love of handheld foods.",
        "cooking_tips": "Make the dough with lard for authentic flakiness. The filling should be well-seasoned and not too wet. Seal the edges with a fork or crimp pattern. Bake or fry until golden brown. Serve hot with chimichurri sauce. Can be filled with various ingredients."
      }
    ],
    "lebanon": [
      {
        "name": "Kibbeh",
        "type": "main",
        "description": "Ground meat and bulgur wheat croquettes",
        "difficulty": "Medium"
      },
      {
        "name": "Fattoush",
        "type": "main",
        "description": "Fresh vegetable salad with toasted pita bread",
        "difficulty": "Easy"
      },
      {
        "name": "Shawarma",
        "type": "main",
        "description": "Marinated meat wrapped in flatbread with vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Hummus",
        "type": "appetizer",
        "description": "Chickpea puree with tahini, lemon, and garlic",
        "difficulty": "Easy"
      }
    ],
    "china": [
      {
        "name": "Peking Duck",
        "type": "main",
        "description": "Crispy-skinned duck served with pancakes and hoisin sauce",
        "difficulty": "Hard",
        "cultural_story": "Peking Duck has been a signature dish of Beijing for over 600 years, originally served in the imperial courts of the Ming Dynasty. The dish was created to showcase the skill of Chinese chefs in preparing duck with crispy skin and tender meat. The duck is traditionally hung to dry for 24 hours before roasting, then cooked in a special oven until the skin is crispy and golden. Peking Duck represents the pinnacle of Chinese culinary artistry and is often served at important celebrations and diplomatic events.",
        "cooking_tips": "Hang the duck to dry for at least 24 hours. Use a special duck oven or high-temperature roasting. The skin should be crispy and golden brown. Carve the duck at the table for presentation. Serve with thin pancakes, hoisin sauce, and green onions. The meat should be tender and the skin crispy."
      },
      {
        "name": "Mapo Tofu",
        "type": "main",
        "description": "Spicy tofu with ground pork and Sichuan peppercorns",
        "difficulty": "Medium",
        "cultural_story": "Mapo Tofu was created in the 1860s by Chen Mapo, a restaurant owner in Chengdu, Sichuan province. The dish combines soft tofu with ground pork in a spicy, numbing sauce made with doubanjiang (fermented bean paste) and Sichuan peppercorns. The name means 'pockmarked grandmother's tofu' and refers to the pockmarked face of the original chef. Mapo Tofu represents the bold, spicy flavors of Sichuan cuisine and the Chinese philosophy of balancing textures and flavors.",
        "cooking_tips": "Use soft tofu for authentic texture. Brown the pork thoroughly before adding other ingredients. Add Sichuan peppercorns for the characteristic numbing sensation. The sauce should be thick and spicy. Serve hot with steamed rice. Don't overcook the tofu."
      },
      {
        "name": "Kung Pao Chicken",
        "type": "main",
        "description": "Stir-fried chicken with peanuts, vegetables, and chili",
        "difficulty": "Medium",
        "cultural_story": "Kung Pao Chicken was named after Ding Baozhen, a Qing Dynasty official whose title was 'Kung Pao' (Palace Guardian). The dish originated in Sichuan province and combines chicken with peanuts, vegetables, and dried chilies in a sweet and spicy sauce. The dish represents the fusion of sweet, sour, and spicy flavors that is characteristic of Sichuan cuisine. Kung Pao Chicken has become one of the most popular Chinese dishes worldwide and showcases the importance of wok cooking in Chinese cuisine.",
        "cooking_tips": "Use a wok over high heat for authentic stir-frying. Cut chicken into uniform pieces for even cooking. Add ingredients in order: aromatics, protein, vegetables, sauce. The sauce should be thick and glossy. Garnish with roasted peanuts. Serve immediately while hot."
      },
      {
        "name": "Xiaolongbao",
        "type": "appetizer",
        "description": "Soup dumplings filled with pork and broth",
        "difficulty": "Hard",
        "cultural_story": "Xiaolongbao originated in Shanghai in the 19th century and are considered one of China's most sophisticated dumplings. The name means 'little basket buns' and refers to the bamboo steamer baskets they're cooked in. The soup inside the dumpling is created by adding gelatin-rich pork stock that melts when steamed. Xiaolongbao represent the skill and precision required in Chinese dumpling making and the importance of soup in Chinese cuisine. They're traditionally served as breakfast or dim sum.",
        "cooking_tips": "Make the dough with hot water for pliability. The filling should include gelatin-rich stock that will melt into soup. Pleat the dumplings carefully to seal in the soup. Steam for exactly 8 minutes. Serve immediately while hot. Dip in vinegar and ginger."
      }
    ],
    "cuba": [
      {
        "name": "Ropa Vieja",
        "type": "main",
        "description": "Shredded beef stew with tomatoes, peppers, and onions served with rice and black beans",
        "difficulty": "Medium",
        "cultural_story": "Ropa Vieja means 'old clothes' in Spanish, named for the shredded appearance of the beef that resembles torn fabric. This dish originated in the Canary Islands and was brought to Cuba by Spanish settlers. It became a staple of Cuban cuisine because it was a way to use leftover meat from Sunday roasts. The dish represents the Cuban philosophy of making something delicious from humble ingredients and the influence of Spanish cooking on Cuban cuisine. It's traditionally served with rice and black beans, representing the complete Cuban meal.",
        "cooking_tips": "Use flank steak or chuck roast for best results. Cook the meat until very tender, then shred. The sauce should be thick and flavorful. Add sofrito (onions, peppers, garlic) for authentic Cuban flavor. Serve with white rice and black beans. The dish should be hearty and comforting."
      },
      {
        "name": "Lechón Asado",
        "type": "main",
        "description": "Slow-roasted pork marinated with citrus, garlic, and herbs",
        "difficulty": "Hard",
        "cultural_story": "Lechón Asado is Cuba's traditional roasted pork dish, often served at celebrations and holidays. The pork is marinated in a mojo criollo (Creole sauce) made with sour orange juice, garlic, and herbs, then slow-roasted until the skin is crispy and the meat is tender. This dish represents the African and Spanish influences on Cuban cuisine, as well as the importance of pork in Cuban celebrations. The mojo criollo marinade is a signature of Cuban cooking and adds bright, citrusy flavors to the rich pork.",
        "cooking_tips": "Use sour orange juice for authentic mojo criollo. Marinate the pork overnight for deep flavor. Cook slowly to render fat and crisp the skin. The meat should be tender and the skin crispy. Serve with rice, beans, and plantains. Baste frequently with the marinade."
      },
      {
        "name": "Arroz con Pollo",
        "type": "main",
        "description": "Chicken and rice cooked with sofrito, saffron, and vegetables",
        "difficulty": "Medium",
        "cultural_story": "Arroz con Pollo is a beloved Cuban comfort food that combines Spanish paella techniques with Cuban ingredients. The dish is made with chicken, rice, and sofrito (the base of Cuban cooking made with onions, peppers, and garlic). The yellow color comes from saffron or annatto, and the dish often includes peas and olives. Arroz con Pollo represents the fusion of Spanish and Cuban culinary traditions and is a staple of Cuban home cooking. It's often served at family gatherings and celebrations.",
        "cooking_tips": "Make sofrito from scratch for authentic flavor. Use chicken with skin for better flavor. Add saffron or annatto for yellow color. Don't stir the rice too much to avoid mushiness. The rice should be fluffy and flavorful. Serve hot with additional sofrito on top."
      },
      {
        "name": "Tostones",
        "type": "appetizer",
        "description": "Twice-fried green plantains served with garlic sauce",
        "difficulty": "Easy",
        "cultural_story": "Tostones are a staple of Cuban cuisine and are made from green plantains that are twice-fried to create crispy, savory chips. The dish has African origins and was brought to Cuba through the slave trade. Tostones represent the African influence on Cuban cuisine and the importance of plantains in Caribbean cooking. They're served as a side dish or appetizer and are often accompanied by a garlic sauce (mojo de ajo). Tostones are a perfect example of how simple ingredients can be transformed into something delicious.",
        "cooking_tips": "Use green, unripe plantains for best texture. Fry once, flatten, then fry again until crispy. Season with salt while hot. Serve with garlic sauce (mojo de ajo). The tostones should be crispy on the outside and tender inside. Don't overcook or they'll be too hard."
      },
      {
        "name": "Cuban Sandwich",
        "type": "main",
        "description": "Pressed sandwich with roasted pork, ham, Swiss cheese, pickles, and mustard",
        "difficulty": "Easy"
      },
      {
        "name": "Moros y Cristianos",
        "type": "main",
        "description": "Black beans and rice cooked together with sofrito and spices",
        "difficulty": "Easy"
      }
    ],
    "spain": [
      {
        "name": "Paella",
        "type": "main",
        "description": "Saffron rice with seafood, chicken, and vegetables",
        "difficulty": "Hard"
      },
      {
        "name": "Tortilla Española",
        "type": "main",
        "description": "Spanish omelette with potatoes and onions",
        "difficulty": "Medium"
      },
      {
        "name": "Gazpacho",
        "type": "main",
        "description": "Cold tomato soup with cucumber and peppers",
        "difficulty": "Easy"
      },
      {
        "name": "Patatas Bravas",
        "type": "appetizer",
        "description": "Fried potatoes with spicy tomato sauce and aioli",
        "difficulty": "Easy"
      }
    ],
    "turkey": [
      {
        "name": "Kebab",
        "type": "main",
        "description": "Grilled meat on skewers with vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Dolma",
        "type": "main",
        "description": "Grape leaves stuffed with rice and herbs",
        "difficulty": "Medium"
      },
      {
        "name": "Pilaf",
        "type": "main",
        "description": "Fragrant rice with meat, nuts, and dried fruits",
        "difficulty": "Easy"
      },
      {
        "name": "Mezze Platter",
        "type": "appetizer",
        "description": "Assortment of small dishes and spreads",
        "difficulty": "Easy"
      }
    ],
    "vietnam": [
      {
        "name": "Pho",
        "type": "main",
        "description": "Rice noodle soup with beef and aromatic herbs",
        "difficulty": "Medium"
      },
      {
        "name": "Bun Bo Hue",
        "type": "main",
        "description": "Spicy beef noodle soup with lemongrass",
        "difficulty": "Hard"
      },
      {
        "name": "Com Tam",
        "type": "main",
        "description": "Broken rice with grilled pork and vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Spring Rolls",
        "type": "appetizer",
        "description": "Fresh rice paper rolls with vegetables and herbs",
        "difficulty": "Easy"
      }
    ],
    "greece": [
      {
        "name": "Moussaka",
        "type": "main",
        "description": "Layered eggplant casserole with ground meat and béchamel",
        "difficulty": "Hard"
      },
      {
        "name": "Souvlaki",
        "type": "main",
        "description": "Grilled meat skewers with pita and tzatziki",
        "difficulty": "Easy"
      },
      {
        "name": "Pastitsio",
        "type": "main",
        "description": "Baked pasta with ground meat and béchamel sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Greek Salad",
        "type": "appetizer",
        "description": "Fresh vegetables with feta cheese and olives",
        "difficulty": "Easy"
      }
    ],
    "brazil": [
      {
        "name": "Feijoada",
        "type": "main",
        "description": "Black bean stew with various cuts of pork",
        "difficulty": "Hard"
      },
      {
        "name": "Moqueca",
        "type": "main",
        "description": "Fish stew with coconut milk and dendê oil",
        "difficulty": "Medium"
      },
      {
        "name": "Picanha",
        "type": "main",
        "description": "Grilled top sirloin cap with rock salt",
        "difficulty": "Medium"
      },
      {
        "name": "Coxinha",
        "type": "appetizer",
        "description": "Shredded chicken croquettes shaped like drumsticks",
        "difficulty": "Medium"
      }
    ],
    "korea": [
      {
        "name": "Bibimbap",
        "type": "main",
        "description": "Mixed rice bowl with vegetables, meat, and gochujang",
        "difficulty": "Medium"
      },
      {
        "name": "Kimchi Jjigae",
        "type": "main",
        "description": "Spicy stew with fermented kimchi and pork",
        "difficulty": "Easy"
      },
      {
        "name": "Bulgogi",
        "type": "main",
        "description": "Marinated grilled beef with sweet soy sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Banchan",
        "type": "appetizer",
        "description": "Assortment of small side dishes and pickles",
        "difficulty": "Easy"
      }
    ],
    "germany": [
      {
        "name": "Sauerbraten",
        "type": "main",
        "description": "Marinated pot roast with gingersnap gravy",
        "difficulty": "Hard"
      },
      {
        "name": "Bratwurst",
        "type": "main",
        "description": "Grilled sausage with mustard and sauerkraut",
        "difficulty": "Easy"
      },
      {
        "name": "Schnitzel",
        "type": "main",
        "description": "Breaded and fried meat cutlet with lemon",
        "difficulty": "Easy"
      },
      {
        "name": "Pretzels",
        "type": "appetizer",
        "description": "Soft baked bread with distinctive knot shape",
        "difficulty": "Medium"
      }
    ],
    "russia": [
      {
        "name": "Beef Stroganoff",
        "type": "main",
        "description": "Sautéed beef in sour cream sauce with mushrooms",
        "difficulty": "Medium"
      },
      {
        "name": "Pelmeni",
        "type": "main",
        "description": "Dumplings filled with meat and served in broth",
        "difficulty": "Medium"
      },
      {
        "name": "Borscht",
        "type": "main",
        "description": "Beet soup with vegetables and sour cream",
        "difficulty": "Easy"
      },
      {
        "name": "Blini",
        "type": "appetizer",
        "description": "Thin pancakes served with caviar and sour cream",
        "difficulty": "Easy"
      }
    ],
    "egypt": [
      {
        "name": "Koshari",
        "type": "main",
        "description": "Layered dish with rice, lentils, pasta, and tomato sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Molokhia",
        "type": "main",
        "description": "Jute leaf soup with chicken and rice",
        "difficulty": "Medium"
      },
      {
        "name": "Ful Medames",
        "type": "main",
        "description": "Slow-cooked fava beans with olive oil and cumin",
        "difficulty": "Easy"
      },
      {
        "name": "Baba Ganoush",
        "type": "appetizer",
        "description": "Roasted eggplant dip with tahini and garlic",
        "difficulty": "Easy"
      }
    ],
    "indonesia": [
      {
        "name": "Nasi Goreng",
        "type": "main",
        "description": "Indonesian fried rice with kecap manis and shrimp paste",
        "difficulty": "Medium"
      },
      {
        "name": "Rendang",
        "type": "main",
        "description": "Slow-cooked beef in coconut milk and spices",
        "difficulty": "Hard"
      },
      {
        "name": "Satay",
        "type": "main",
        "description": "Grilled meat skewers with peanut sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Gado-gado",
        "type": "appetizer",
        "description": "Vegetable salad with peanut sauce dressing",
        "difficulty": "Easy"
      }
    ],
    "nigeria": [
      {
        "name": "Jollof Rice",
        "type": "main",
        "description": "Spiced rice cooked in tomato sauce with meat",
        "difficulty": "Medium"
      },
      {
        "name": "Egusi Soup",
        "type": "main",
        "description": "Ground melon seed soup with leafy vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Pepper Soup",
        "type": "main",
        "description": "Spicy broth with meat and aromatic spices",
        "difficulty": "Easy"
      },
      {
        "name": "Suya",
        "type": "appetizer",
        "description": "Spicy grilled meat skewers with groundnut powder",
        "difficulty": "Medium"
      }
    ],
    "australia": [
      {
        "name": "Meat Pie",
        "type": "main",
        "description": "Flaky pastry filled with minced meat and gravy",
        "difficulty": "Medium"
      },
      {
        "name": "Barramundi",
        "type": "main",
        "description": "Grilled or pan-fried Australian sea bass",
        "difficulty": "Easy"
      },
      {
        "name": "Lamb Roast",
        "type": "main",
        "description": "Roasted lamb with rosemary and garlic",
        "difficulty": "Medium"
      },
      {
        "name": "Damper",
        "type": "appetizer",
        "description": "Traditional bush bread cooked over coals",
        "difficulty": "Easy"
      }
    ],
    "canada": [
      {
        "name": "Poutine",
        "type": "main",
        "description": "French fries topped with cheese curds and gravy",
        "difficulty": "Easy"
      },
      {
        "name": "Tourtière",
        "type": "main",
        "description": "Meat pie with ground pork and spices",
        "difficulty": "Medium"
      },
      {
        "name": "Maple Glazed Salmon",
        "type": "main",
        "description": "Salmon with Canadian maple syrup glaze",
        "difficulty": "Easy"
      },
      {
        "name": "Bannock",
        "type": "appetizer",
        "description": "Traditional Indigenous flatbread",
        "difficulty": "Easy"
      }
    ],
    "iran": [
      {
        "name": "Ghormeh Sabzi",
        "type": "main",
        "description": "Herb stew with meat, kidney beans, and dried limes",
        "difficulty": "Hard"
      },
      {
        "name": "Tahdig",
        "type": "main",
        "description": "Crispy rice bottom with saffron and butter",
        "difficulty": "Medium"
      },
      {
        "name": "Fesenjan",
        "type": "main",
        "description": "Pomegranate and walnut stew with meat",
        "difficulty": "Medium"
      },
      {
        "name": "Kashk-e Bademjan",
        "type": "appetizer",
        "description": "Eggplant dip with whey and fried onions",
        "difficulty": "Easy"
      }
    ],
    "philippines": [
      {
        "name": "Adobo",
        "type": "main",
        "description": "Meat marinated in vinegar, soy sauce, and garlic",
        "difficulty": "Easy"
      },
      {
        "name": "Sinigang",
        "type": "main",
        "description": "Sour tamarind soup with meat and vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Kare-kare",
        "type": "main",
        "description": "Peanut stew with meat and vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Lumpia",
        "type": "appetizer",
        "description": "Fresh or fried spring rolls with vegetables",
        "difficulty": "Medium"
      }
    ],
    "saudi_arabia": [
      {
        "name": "Kabsa",
        "type": "main",
        "description": "Spiced rice with meat and aromatic spices",
        "difficulty": "Medium"
      },
      {
        "name": "Mandi",
        "type": "main",
        "description": "Slow-cooked meat and rice with Yemeni spices",
        "difficulty": "Hard"
      },
      {
        "name": "Shawarma",
        "type": "main",
        "description": "Marinated meat wrapped in flatbread",
        "difficulty": "Medium"
      },
      {
        "name": "Hummus",
        "type": "appetizer",
        "description": "Chickpea puree with tahini and olive oil",
        "difficulty": "Easy"
      }
    ],
    "south_africa": [
      {
        "name": "Bobotie",
        "type": "main",
        "description": "Spiced minced meat with egg custard topping",
        "difficulty": "Medium"
      },
      {
        "name": "Biltong",
        "type": "main",
        "description": "Air-dried cured meat with vinegar and spices",
        "difficulty": "Hard"
      },
      {
        "name": "Potjiekos",
        "type": "main",
        "description": "Slow-cooked stew in cast iron pot",
        "difficulty": "Medium"
      },
      {
        "name": "Biltong",
        "type": "appetizer",
        "description": "Dried cured meat strips",
        "difficulty": "Hard"
      }
    ],
    "chile": [
      {
        "name": "Pastel de Choclo",
        "type": "main",
        "description": "Corn pie with ground meat and hard-boiled eggs",
        "difficulty": "Medium"
      },
      {
        "name": "Cazuela",
        "type": "main",
        "description": "Hearty soup with meat, vegetables, and rice",
        "difficulty": "Easy"
      },
      {
        "name": "Empanadas",
        "type": "main",
        "description": "Baked pastries filled with meat or seafood",
        "difficulty": "Medium"
      },
      {
        "name": "Pebre",
        "type": "appetizer",
        "description": "Fresh salsa with tomatoes, onions, and cilantro",
        "difficulty": "Easy"
      }
    ],
    "sweden": [
      {
        "name": "Meatballs",
        "type": "main",
        "description": "Ground meat balls with lingonberry sauce",
        "difficulty": "Easy"
      },
      {
        "name": "Gravlax",
        "type": "main",
        "description": "Cured salmon with dill and mustard sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Janssons Frestelse",
        "type": "main",
        "description": "Potato casserole with anchovies and cream",
        "difficulty": "Medium"
      },
      {
        "name": "Pickled Herring",
        "type": "appetizer",
        "description": "Marinated herring with onions and dill",
        "difficulty": "Easy"
      }
    ],
    "poland": [
      {
        "name": "Bigos",
        "type": "main",
        "description": "Hunter's stew with sauerkraut and meat",
        "difficulty": "Medium"
      },
      {
        "name": "Pierogi",
        "type": "main",
        "description": "Dumplings filled with meat, cheese, or potatoes",
        "difficulty": "Medium"
      },
      {
        "name": "Kotlet Schabowy",
        "type": "main",
        "description": "Breaded pork cutlet with mashed potatoes",
        "difficulty": "Easy"
      },
      {
        "name": "Zupa Ogórkowa",
        "type": "appetizer",
        "description": "Dill pickle soup with potatoes",
        "difficulty": "Easy"
      }
    ],
    "ukraine": [
      {
        "name": "Borscht",
        "type": "main",
        "description": "Beet soup with meat and vegetables",
        "difficulty": "Easy"
      },
      {
        "name": "Varenyky",
        "type": "main",
        "description": "Boiled dumplings with various fillings",
        "difficulty": "Medium"
      },
      {
        "name": "Holubtsi",
        "type": "main",
        "description": "Cabbage rolls filled with meat and rice",
        "difficulty": "Medium"
      },
      {
        "name": "Salo",
        "type": "appetizer",
        "description": "Cured pork fatback with bread and garlic",
        "difficulty": "Easy"
      }
    ],
    "norway": [
      {
        "name": "Lutefisk",
        "type": "main",
        "description": "Dried cod rehydrated in lye solution",
        "difficulty": "Hard"
      },
      {
        "name": "Fårikål",
        "type": "main",
        "description": "Lamb and cabbage stew with black pepper",
        "difficulty": "Easy"
      },
      {
        "name": "Rakfisk",
        "type": "main",
        "description": "Fermented trout with flatbread",
        "difficulty": "Hard"
      },
      {
        "name": "Brunost",
        "type": "appetizer",
        "description": "Brown cheese with crackers",
        "difficulty": "Easy"
      }
    ],
    "israel": [
      {
        "name": "Shakshuka",
        "type": "main",
        "description": "Eggs poached in tomato sauce with peppers",
        "difficulty": "Easy"
      },
      {
        "name": "Falafel",
        "type": "main",
        "description": "Deep-fried chickpea fritters with tahini",
        "difficulty": "Medium"
      },
      {
        "name": "Sabich",
        "type": "main",
        "description": "Pita sandwich with eggplant and hard-boiled eggs",
        "difficulty": "Easy"
      },
      {
        "name": "Hummus",
        "type": "appetizer",
        "description": "Chickpea puree with tahini and olive oil",
        "difficulty": "Easy"
      }
    ],
    "pakistan": [
      {
        "name": "Biryani",
        "type": "main",
        "description": "Layered rice with meat and aromatic spices",
        "difficulty": "Hard"
      },
      {
        "name": "Karahi",
        "type": "main",
        "description": "Spicy meat curry cooked in wok-style pan",
        "difficulty": "Medium"
      },
      {
        "name": "Nihari",
        "type": "main",
        "description": "Slow-cooked beef stew with bone marrow",
        "difficulty": "Hard"
      },
      {
        "name": "Pakoras",
        "type": "appetizer",
        "description": "Vegetable fritters in chickpea flour batter",
        "difficulty": "Easy"
      }
    ],
    "bangladesh": [
      {
        "name": "Ilish Bhapa",
        "type": "main",
        "description": "Steamed hilsa fish with mustard paste",
        "difficulty": "Medium"
      },
      {
        "name": "Kacchi Biryani",
        "type": "main",
        "description": "Layered rice with raw meat and spices",
        "difficulty": "Hard"
      },
      {
        "name": "Bhuna Khichuri",
        "type": "main",
        "description": "Spiced rice and lentils with meat",
        "difficulty": "Medium"
      },
      {
        "name": "Bhorta",
        "type": "appetizer",
        "description": "Mashed vegetables with spices and oil",
        "difficulty": "Easy"
      }
    ],
    "hungary": [
      {
        "name": "Goulash",
        "type": "main",
        "description": "Hearty stew with beef, paprika, and vegetables",
        "difficulty": "Medium"
      },
      {
        "name": "Chicken Paprikash",
        "type": "main",
        "description": "Chicken in paprika cream sauce with dumplings",
        "difficulty": "Medium"
      },
      {
        "name": "Lángos",
        "type": "main",
        "description": "Deep-fried flatbread with sour cream and cheese",
        "difficulty": "Easy"
      },
      {
        "name": "Lecsó",
        "type": "appetizer",
        "description": "Stewed peppers and tomatoes with eggs",
        "difficulty": "Easy"
      }
    ],
    "czech_republic": [
      {
        "name": "Svíčková",
        "type": "main",
        "description": "Beef sirloin with cream sauce and dumplings",
        "difficulty": "Medium"
      },
      {
        "name": "Guláš",
        "type": "main",
        "description": "Beef stew with onions and paprika",
        "difficulty": "Medium"
      },
      {
        "name": "Vepřo-knedlo-zelo",
        "type": "main",
        "description": "Roast pork with dumplings and sauerkraut",
        "difficulty": "Medium"
      },
      {
        "name": "Bramboráky",
        "type": "appetizer",
        "description": "Potato pancakes with garlic and marjoram",
        "difficulty": "Easy"
      }
    ],
    "romania": [
      {
        "name": "Sarmale",
        "type": "main",
        "description": "Cabbage rolls filled with meat and rice",
        "difficulty": "Medium"
      },
      {
        "name": "Mici",
        "type": "main",
        "description": "Grilled minced meat rolls with mustard",
        "difficulty": "Medium"
      },
      {
        "name": "Ciorbă",
        "type": "main",
        "description": "Sour soup with meat and vegetables",
        "difficulty": "Easy"
      },
      {
        "name": "Salată de Vinete",
        "type": "appetizer",
        "description": "Roasted eggplant salad with onions",
        "difficulty": "Easy"
      }
    ],
    "croatia": [
      {
        "name": "Pašticada",
        "type": "main",
        "description": "Slow-cooked beef with prunes and wine sauce",
        "difficulty": "Hard"
      },
      {
        "name": "Crni Rižot",
        "type": "main",
        "description": "Black risotto with cuttlefish ink",
        "difficulty": "Medium"
      },
      {
        "name": "Peka",
        "type": "main",
        "description": "Meat and vegetables cooked under bell lid",
        "difficulty": "Medium"
      },
      {
        "name": "Pršut",
        "type": "appetizer",
        "description": "Dry-cured ham with cheese and olives",
        "difficulty": "Easy"
      }
    ],
    "portugal": [
      {
        "name": "Bacalhau à Brás",
        "type": "main",
        "description": "Shredded cod with eggs and potatoes",
        "difficulty": "Medium"
      },
      {
        "name": "Francesinha",
        "type": "main",
        "description": "Sandwich with meat, cheese, and beer sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Cozido à Portuguesa",
        "type": "main",
        "description": "Boiled meat and vegetables with sausages",
        "difficulty": "Medium"
      },
      {
        "name": "Pastéis de Bacalhau",
        "type": "appetizer",
        "description": "Codfish fritters with parsley",
        "difficulty": "Medium"
      }
    ],
    "netherlands": [
      {
        "name": "Stamppot",
        "type": "main",
        "description": "Mashed potatoes with vegetables and sausage",
        "difficulty": "Easy"
      },
      {
        "name": "Hutspot",
        "type": "main",
        "description": "Mashed potatoes with carrots and onions",
        "difficulty": "Easy"
      },
      {
        "name": "Erwtensoep",
        "type": "main",
        "description": "Split pea soup with sausage and bacon",
        "difficulty": "Easy"
      },
      {
        "name": "Bitterballen",
        "type": "appetizer",
        "description": "Deep-fried meat croquettes with mustard",
        "difficulty": "Medium"
      }
    ],
    "belgium": [
      {
        "name": "Moules-frites",
        "type": "main",
        "description": "Mussels with fries and white wine sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Carbonnade",
        "type": "main",
        "description": "Beef stew with beer and onions",
        "difficulty": "Medium"
      },
      {
        "name": "Waterzooi",
        "type": "main",
        "description": "Creamy stew with chicken or fish",
        "difficulty": "Medium"
      },
      {
        "name": "Frites",
        "type": "appetizer",
        "description": "Double-fried potatoes with mayonnaise",
        "difficulty": "Easy"
      }
    ],
    "austria": [
      {
        "name": "Wiener Schnitzel",
        "type": "main",
        "description": "Breaded veal cutlet with lemon and potatoes",
        "difficulty": "Easy"
      },
      {
        "name": "Tafelspitz",
        "type": "main",
        "description": "Boiled beef with horseradish sauce",
        "difficulty": "Medium"
      },
      {
        "name": "Goulash",
        "type": "main",
        "description": "Beef stew with paprika and onions",
        "difficulty": "Medium"
      },
      {
        "name": "Kaiserschmarrn",
        "type": "appetizer",
        "description": "Shredded pancake with raisins and jam",
        "difficulty": "Medium"
      }
    ],
    "switzerland": [
      {
        "name": "Rösti",
        "type": "main",
        "description": "Crispy grated potato cake with cheese",
        "difficulty": "Easy"
      },
      {
        "name": "Fondue",
        "type": "main",
        "description": "Melted cheese with bread and vegetables",
        "difficulty": "Easy"
      },
      {
        "name": "Zürcher Geschnetzeltes",
        "type": "main",
        "description": "Sliced veal in cream sauce with mushrooms",
        "difficulty": "Medium"
      },
      {
        "name": "Raclette",
        "type": "appetizer",
        "description": "Melted cheese with potatoes and pickles",
        "difficulty": "Easy"
      }
    ],
    "ireland": [
      {
        "name": "Irish Stew",
        "type": "main",
        "description": "Lamb stew with potatoes and root vegetables",
        "difficulty": "Easy"
      },
      {
        "name": "Colcannon",
        "type": "main",
        "description": "Mashed potatoes with cabbage and butter",
        "difficulty": "Easy"
      },
      {
        "name": "Boxty",
        "type": "main",
        "description": "Potato pancakes with flour and buttermilk",
        "difficulty": "Easy"
      },
      {
        "name": "Soda Bread",
        "type": "appetizer",
        "description": "Quick bread made with buttermilk and soda",
        "difficulty": "Easy"
      }
    ],
    "denmark": [
      {
        "name": "Frikadeller",
        "type": "main",
        "description": "Danish meatballs with gravy and potatoes",
        "difficulty": "Medium"
      },
      {
        "name": "Stjerneskud",
        "type": "main",
        "description": "Open-faced sandwich with fish and shrimp",
        "difficulty": "Medium"
      },
      {
        "name": "Hakkebøf",
        "type": "main",
        "description": "Pan-fried beef patty with onions and gravy",
        "difficulty": "Easy"
      },
      {
        "name": "Rugbrød",
        "type": "appetizer",
        "description": "Dark rye bread with seeds",
        "difficulty": "Medium"
      }
    ],
    "finland": [
      {
        "name": "Karelian Pies",
        "type": "main",
        "description": "Rice-filled pastries with egg butter",
        "difficulty": "Medium"
      },
      {
        "name": "Kalakukko",
        "type": "main",
        "description": "Fish and pork pie baked in rye bread",
        "difficulty": "Hard"
      },
      {
        "name": "Lohikeitto",
        "type": "main",
        "description": "Salmon soup with cream and dill",
        "difficulty": "Easy"
      },
      {
        "name": "Karjalanpiirakka",
        "type": "appetizer",
        "description": "Rice-filled pastries with egg butter",
        "difficulty": "Medium"
      }
    ],
    "venezuela": [
      {
        "name": "Pabellón Criollo",
        "type": "main",
        "description": "Shredded beef with black beans and rice",
        "difficulty": "Medium"
      },
      {
        "name": "Arepas",
        "type": "main",
        "description": "Cornmeal patties filled with various ingredients",
        "difficulty": "Easy"
      },
      {
        "name": "Hallacas",
        "type": "main",
        "description": "Corn dough filled with meat and vegetables",
        "difficulty": "Hard"
      },
      {
        "name": "Tequeños",
        "type": "appetizer",
        "description": "Cheese sticks wrapped in dough and fried",
        "difficulty": "Easy"
      }
    ],
    "colombia": [
      {
        "name": "Bandeja Paisa",
        "type": "main",
        "description": "Platter with beans, rice, meat, and plantains",
        "difficulty": "Hard"
      },
      {
        "name": "Ajiaco",
        "type": "main",
        "description": "Chicken and potato soup with corn",
        "difficulty": "Medium"
      },
      {
        "name": "Sancocho",
        "type": "main",
        "description": "Hearty soup with meat, vegetables, and plantains",
        "difficulty": "Medium"
      },
      {
        "name": "Arepas",
        "type": "appetizer",
        "description": "Cornmeal patties with cheese or meat",
        "difficulty": "Easy"
      }
    ],
    "ecuador": [
      {
        "name": "Ceviche",
        "type": "main",
        "description": "Fresh seafood marinated in citrus juice",
        "difficulty": "Easy"
      },
      {
        "name": "Encebollado",
        "type": "main",
        "description": "Fish soup with yuca and pickled onions",
        "difficulty": "Medium"
      },
      {
        "name": "Seco de Chivo",
        "type": "main",
        "description": "Goat stew with beer and spices",
        "difficulty": "Medium"
      },
      {
        "name": "Empanadas",
        "type": "appetizer",
        "description": "Fried pastries filled with cheese or meat",
        "difficulty": "Medium"
      }
    ],
    "uruguay": [
      {
        "name": "Chivito",
        "type": "main",
        "description": "Steak sandwich with ham, cheese, and eggs",
        "difficulty": "Medium"
      },
      {
        "name": "Asado",
        "type": "main",
        "description": "Barbecue with various cuts of beef",
        "difficulty": "Medium"
      },
      {
        "name": "Milanesa",
        "type": "main",
        "description": "Breaded and fried meat cutlet",
        "difficulty": "Easy"
      },
      {
        "name": "Empanadas",
        "type": "appetizer",
        "description": "Baked pastries with meat or cheese",
        "difficulty": "Medium"
      }
    ]
  }
}
